---
kind: property
id: P:Autodesk.Revit.DB.Architecture.MultistoryStairs.StandardStairsId
source: html/2430a0ec-b9b4-28ad-de89-3d7a1340d239.htm
---
# Autodesk.Revit.DB.Architecture.MultistoryStairs.StandardStairsId Property

Id of the stair associated with the Reference Level for the multistory stairs.
 The standard stair is regarded as a definition to generate new stairs when extending multistory stairs to a different level height.

## Syntax (C#)
```csharp
public ElementId StandardStairsId { get; }
```